package com.javarush.test.level01.lesson06.task01;

/* Контракт
Вывести на экран текст нового контракта:
Меня зовут Амиго.

Я согласен на зарплату $800/месяц в первый год.
Я согласен на зарплату $1500/месяц во второй год.
Я согласен на зарплату $2200/месяц в третий год.
Я согласен на зарплату $2700/месяц в четвертый год.
Я согласен на зарплату $3200/месяц в пятый год.

Поцелуй мой блестящий металлический зад!
*/
public class Solution
{
    public static void main(String[] args)
    {


        String name = "Меня зовут Амиго.";
        String text1 = "Я согласен на зарплату $800/месяц в первый год.";
        String text2 = "Я согласен на зарплату $1500/месяц во второй год.";
        String text3 = "Я согласен на зарплату $2200/месяц в третий год.";
        String text4 = "Я согласен на зарплату $2700/месяц в четвертый год.";
        String text5 = "Я согласен на зарплату $3200/месяц в пятый год.";

        String end = "Поцелуй мой блестящий металлический зад!";

        System.out.println(name);

        System.out.println(text1);
        System.out.println(text2);
        System.out.println(text3);
        System.out.println(text4);
        System.out.println(text5);

        System.out.println(end);

            }
}